prodotto-kar/src/main/resources/NoPlugin/Esempi/DCSanita_FSE_2008-01_comunicaEventoRicovero.in.xml

<?xml version="1.0" encoding="ISO-8859-1"?> 
<!--
<TestInfo>
	<Autore>Gianluca Agresti</Autore>
	<DataPreparazione>23/01/2009</DataPreparazione>
	<CodiceTest>IN.8054000013</CodiceTest>
	<CodiceContesto>C06</CodiceContesto>
	<TipoTest>FUN13_VER</TipoTest>
	<Priorita>H</Priorita>
	<DescrizioneCaso>Tentativo di registrazione a seguito di una accettazione evento di Ricovero che era stato annullato op. 2 </DescrizioneCaso>
	<DescrizioneRisultatoAtteso>OK </DescrizioneRisultatoAtteso>
</TestInfo>
-->
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" soap-env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<soap-env:Header>
<t:CoopContext xmlns:t="http://www.crs.lombardia.it/schemas/mw/2004-01/coopcontext/">
		<Transport>
			<Mode>Sync</Mode>
			<Dest>DCSanita</Dest>
		</Transport>
			<Security>
			<FunContext>
				<credential>
					<validity>
						<emittedDate>15/11/2005+10:59:18,531</emittedDate>
						<sessionMaxTime>15/11/2005+10:59:18,531</sessionMaxTime>
					</validity>
					<vrs>
						<mjr>1</mjr>
						<min>0</min>
					</vrs>
					<ctf>
						<reg>
							<cod/>
							<des/>
						</reg>
						<app>
							<cod/>
							<des/>
						</app>
						<pro>
							<cod/>
							<des/>
						</pro>
						<ter>
							<cod/>
							<des/>
						</ter>
						<str>
							<cod>030960</cod>
							<des/>
						</str>
						<pre>
							<cod>03090300</cod>
							<des/>
						</pre>
						<rep>
							<cod/>
							<des/>
						</rep>
					</ctf>
					<role>
						<code>12</code>
						<description>Farmacista Titolare</description>
					</role>
					<userId>MDFPBL57E10E623P</userId>
					<iupSeed>12345</iupSeed>
				</credential>
			</FunContext>
			<CitCardPresent>false</CitCardPresent>
			<CitAuth>false</CitAuth>
			<CitCF></CitCF>
			<CitSmartCardSN></CitSmartCardSN>
		</Security>
		<Sla>
			<Log>
				<Global>
					<TrackID>1132048757203</TrackID>
					<Timestamp>15/11/2005+10:59:18,562</Timestamp>
				</Global>
			</Log>
		</Sla>
		</t:CoopContext>
		<a:AppContext xmlns:a="http://www.crs.lombardia.it/schemas/mw/2004-01/appcontext/">
			<Request clientProd="DCSanita" clientVer="1.0"/>
		</a:AppContext>
	</soap-env:Header>
	<soap-env:Body>
	<m:FSE.comunicaEventoRicovero
  xmlns:m="http://www.crs.lombardia.it/schemas/DCSanita/FSE/2008-01/comunicaEventoSpecialistico/"
  dataSetVersion="1.0">
        <eventoRicovero>
    <numeroProgressivo>10</numeroProgressivo>
	<strutturaErogazione>
       <idEnte>030960</idEnte>
       <idPresidio>03090300</idPresidio>
    </strutturaErogazione>
    <cittadino>
       <idCittadino tipo="CF">FSCCNC75C09E623G</idCittadino>
       <cognomeCittadino>dueFSEcomunicaEventoRicovero</cognomeCittadino>
       <nomeCittadino>duecomunicaEventoRicovero</nomeCittadino>
       <sessoCittadino>M</sessoCittadino>
       <dataNascitaCittadino>19680309</dataNascitaCittadino>
       <idComuneNascitaCittadino>013130</idComuneNascitaCittadino>
    </cittadino>
    <idTipoComunicazione>A</idTipoComunicazione>
    <numeroNosologico>222BBBB222</numeroNosologico>
    <dataOraRicovero></dataOraRicovero>
    <idRepartoRicovero></idRepartoRicovero>
    <datiAccettazione>
         <idRegimeRicovero>1</idRegimeRicovero>
         <idTipoRicovero></idTipoRicovero>
         <idProvenienzaPaziente>013130</idProvenienzaPaziente>
         <idOnereDegenza></idOnereDegenza>
         <idModalitaTrauma></idModalitaTrauma>
         <numeroPrericovero></numeroPrericovero>
         <dataPrericovero></dataPrericovero>
         <IUP>TEST00008054</IUP>
         <descrizioneDiagnosiIngresso></descrizioneDiagnosiIngresso>
         <codiceDiagnosiIngresso></codiceDiagnosiIngresso>
    </datiAccettazione>
</eventoRicovero>
</m:FSE.comunicaEventoRicovero>
</soap-env:Body>
</soap-env:Envelope>
